#!/usr/bin/env python3

print('Он \'плохой\' человек!') # экранирование \'
print("Он 'плохой' человек!")
print('-' * 20)

print("Hello, \nWorld!") # перевод строки \n
print('-' * 20)

name = 'Kate'
age = 21
print("Привет, меня зовут " + name + "!") # конкатенация +
print("Мне " + str(age) + " год.") 
# Нельзя конкатенировать разные типы данных.
# type casting - перевод из одного типа данных в другой
print('-' * 20)

name = input("Введите свое имя: ")
age = input("Укажите свой возраст: ")
# input() всегда возвращает строку
print("\nПривет, " + name + "!\nТебе уже " + age + " год! =D")
print('-' * 20)

a = 10
a = -a # унарный минус
print(a)
print('-' * 20)

b = 5.65
c = 11.34
print(round(b)) # round() - округляет число

import math
print(math.floor(b)) # принудительно округляет число в меньшую сторону
print(math.ceil(c)) # принудительно округляет число в большую сторону
print("pi =", math.pi) # выводит точное число pi, однако точность ограничивается точностью вещественного числа в Python
print('-' * 20)
